; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	infrared0 - mode
	thermograph3 - mode
	image4 - mode
	image1 - mode
	infrared2 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image4)
	(calibration_target instrument1 Star0)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 image4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image1)
	(supports instrument4 image4)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument6 image1)
	(supports instrument6 infrared2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star2)
	(supports instrument7 image4)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument9 image1)
	(calibration_target instrument9 Star0)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon5)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star0)
	(supports instrument12 image1)
	(calibration_target instrument12 Star2)
	(supports instrument13 infrared2)
	(supports instrument13 image4)
	(calibration_target instrument13 GroundStation1)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 Planet10)
	(pointing satellite2 Star2)
	(pointing satellite3 Planet7)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon6 image4)
	(have_image Planet7 thermograph3)
	(have_image Star8 image1)
	(have_image Planet9 image4)
	(have_image Planet10 infrared2)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 image4)
	(have_image Phenomenon13 infrared2)
))

)

; plan
1. (turn_to satellite3 planet7 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 planet7)
   goals met: 1 of 13
2. (turn_to satellite2 star2 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star2)
   goals met: 2 of 13
3. (turn_to satellite1 groundstation4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 13
4. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 13
5. (calibrate satellite1 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 2 of 13
6. (turn_to satellite1 planet7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet7)
   goals met: 2 of 13
7. (take_image satellite1 planet7 instrument5 thermograph3)
   added: (have_image planet7 thermograph3)
   goals met: 3 of 13
8. (turn_to satellite1 phenomenon5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 13
9. (take_image satellite1 phenomenon5 instrument5 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 4 of 13
10. (turn_to satellite1 phenomenon11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 13
11. (turn_to satellite0 groundstation4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 13
12. (take_image satellite1 phenomenon11 instrument5 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 5 of 13
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 13
14. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 5 of 13
15. (turn_to satellite0 phenomenon13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 13
16. (take_image satellite0 phenomenon13 instrument0 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 6 of 13
17. (turn_to satellite0 phenomenon6 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 13
18. (take_image satellite0 phenomenon6 instrument0 image4)
   added: (have_image phenomenon6 image4)
   goals met: 7 of 13
19. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 7 of 13
20. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 8 of 13
21. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 8 of 13
22. (take_image satellite0 planet9 instrument0 image4)
   added: (have_image planet9 image4)
   goals met: 9 of 13
23. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 9 of 13
24. (take_image satellite0 star12 instrument0 image4)
   added: (have_image star12 image4)
   goals met: 10 of 13
25. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 11 of 13
26. (turn_to satellite1 star8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star8)
   goals met: 11 of 13
27. (take_image satellite1 star8 instrument5 image1)
   added: (have_image star8 image1)
   goals met: 12 of 13
28. (turn_to satellite1 planet10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet10)
   goals met: 13 of 13
